[
  {
    "id": 1,
    "title": "Длинношерстный котик в саду",
    "text": "'m baby jawn four loko air plant, lo-fi farm-to-table fashion axe taiyaki forage. Gluten-free subway tile brunch, twee pork belly franzen deep v. Slow-carb cronut woke umami put a bird on it, YOLO actually blog DIY air plant. Glossier coloring book fingerstache kogi, vibecession pinterest marfa sus. Viral portland slow-carb, hoodie hexagon iPhone taxidermy truffaut meh small batch.",
    "image": "/media/black-cat-placeholder.jpg",
    "url": "/articles/1",
    "timestamp": "December 24, 2024"
  },
  {
    "id": 2,
    "title": "Котик",
    "text": "Meatball porchetta fatback, doner leberkas pork belly pancetta pork chop spare ribs beef ribs. Tongue kielbasa salami chislic, meatloaf t-bone andouille ground round sausage tri-tip capicola sirloin. Jerky pig ground round pork belly, picanha leberkas alcatra beef kielbasa pastrami tri-tip rump chuck porchetta chicken. Cupim jowl doner pancetta pork tenderloin. Shankle meatball venison t-bone turkey ball tip corned beef andouille meatloaf pastrami fatback pork belly salami. Meatball porchetta fatback, doner leberkas pork belly pancetta pork chop spare ribs beef ribs. Tongue kielbasa salami chislic, meatloaf t-bone andouille ground round sausage tri-tip capicola sirloin. Jerky pig ground round pork belly, picanha leberkas alcatra beef kielbasa pastrami tri-tip rump chuck porchetta chicken. Cupim jowl doner pancetta pork tenderloin. Shankle meatball venison t-bone turkey ball tip corned beef andouille meatloaf pastrami fatback pork belly salami. Meatball porchetta fatback, doner leberkas pork belly pancetta pork chop spare ribs beef ribs. Tongue kielbasa salami chislic, meatloaf t-bone andouille ground round sausage tri-tip capicola sirloin. Jerky pig ground round pork belly, picanha leberkas alcatra beef kielbasa pastrami tri-tip rump chuck porchetta chicken. Cupim jowl doner pancetta pork tenderloin. Shankle meatball venison t-bone turkey ball tip corned beef andouille meatloaf pastrami fatback pork belly salami.",
    "image": "/media/close-cat-placeholder.jpg",
    "url": "/articles/2",
    "timestamp": "January 01, 2025"
  },
  {
    "id": 3,
    "title": "Этот котик похож на одного знакомого кота по имени Момус",
    "text": "Это текст второй статьи. короткий текст для тестирования",
    "image": "/media/persian-cat-placeholder.jpg",
    "url": "/articles/3",
    "timestamp": "January 10, 2025"
  },
  {
    "id": 4,
    "title": "А этот кот похож на чернушку но без белого пятнышка на грудке. еще более длинный тайтл для тестирования ",
    "text": "Chocolate sweet halvah caramels dragée lemon drops muffin fruitcake lollipop. Cheesecake tiramisu chocolate cake icing oat cake. Sweet marshmallow marshmallow chocolate tiramisu topping tootsie roll lemon drops. Macaroon donut candy canes tootsie roll cotton candy dessert.",
    "image": "/media/wild-cat-placeholder.jpg",
    "url": "/articles/4",
    "timestamp": "January 15, 2025"
  }
]